<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Governorate;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $cities = [

            'دمشق' => [
                'دمشق',
                'اليرموك',
                'جرمانا',
                'القابون',
                'المزة',
                'الميدان',
                'باب توما',
                'باب شرقي',
                'باب الجابية',
                'باب السلام',
                'باب مصلى',
                'باب توينان',],

            'ريف دمشق' => [
                'معلولا',
                'صيدنايا',
                'النبك',
                'يبرود',
                'الزبداني',
                'بلودان',
            ],

            'حلب' => [
                'حلب',
                'عينتاب',
                'منبج',
                'الباب',
                'إعزاز',
                'جرابلس',
                'تل رفعت',
                'عفرين',
                'مارع',
            ],

            'حمص' => [
                'حمص',
                'تدمر',
                'القصير',
                'الرستن',
                'تلكلخ',
                'الحولة',
            ],

            'حماة' => [
                'حماة',
                'السقيلبية',
                'مصياف',
                'محردة',
                'سلمية',
                'اللطامنة',
            ],

            'اللاذقية' => [
                'اللاذقية',
                'جبلة',
                'القرداحة',
                'كسب',
                'الحفة',

            ],

            'طرطوس' => [
                'طرطوس',
                'بانياس',
                'صافيتا',
                'الدريكيش',
                'الشيخ بدر',
            ],

            'إدلب' => [
                'إدلب',
                'معرة النعمان',
                'أريحا',
                'جسر الشغور',
                'كفرنبل',
                'سراقب',
            ],

            'درعا' => [
                'درعا',
                'بصرى الشام',
                'نوى',
                'إزرع',
            ],

            'دير الزور' => [
                'دير الزور',
                'الميادين',
                'البوكمال',
            ],

            'الحسكة' => [
                'الحسكة',
                'القامشلي',
                'رأس العين',
                'المالكية',
            ],

            'الرقة' => [
                'الرقة',
                'تل أبيض',
                'الطبقة',
            ],

            'القنيطرة' => [
                'القنيطرة',
                'خان أرنبة',
            ],

            'السويداء' => [
                'السويداء',
                'شهبا',
                'صلخد',
            ],
        ];

        foreach ($cities as $governorateName => $cityNames) {

            $governorate = Governorate::firstOrCreate([
                'name' => $governorateName,
            ]);

            foreach ($cityNames as $cityName) {

                City::firstOrCreate([
                    'name' => $cityName,
                    'governorate_id' => $governorate->id,
                ]);
            }
        }
    }
}